{
  "text": "14.1. Normal and Abrupt Completion of Statements Every statement has a normal mode of execution in which certain computational steps are carried out. The following sections describe the normal mode of execution for each kind of statement. If all the steps are carried out as described, with no indication of abrupt completion, the statement is said to complete normally . However, certain events may prevent a statement from completing normally: The break ( §14.15 ), continue ( §14.16 ), and return ( §14.17 ) statements cause a transfer of control that may prevent normal completion of statements that contain them. Evaluation of certain expressions may throw exceptions from the Java Virtual Machine ( §15.6 ). An explicit throw ( §14.18 ) statement also results in an exception. An exception causes a transfer of control that may prevent normal completion of statements. If such an event occurs, then execution of one or more statements may be terminated before all steps of their normal mode of execution have completed; such statements are said to complete abruptly . An abrupt completion always has an associated reason , which is one of the following: A break with no label A break with a given label A continue with no label A continue with a given label A return with no value A return with a given value A throw with a given value, including exceptions thrown by the Java Virtual Machine The terms \"complete normally\" and \"complete abruptly\" also apply to the evaluation of expressions ( §15.6 ). The only reason an expression can complete abruptly is that an exception is thrown, because of either a throw with a given value ( §14.18 ) or a run-time exception or error ( §11 ( Exceptions ) , §15.6 ). If a statement evaluates an expression, abrupt completion of the expression always causes the immediate abrupt completion of the statement, with the same reason. All succeeding steps in the normal mode of execution are not performed. Unless otherwise specified in this chapter, abrupt completion of a substatement causes the immediate abrupt completion of the statement itself, with the same reason, and all succeeding steps in the normal mode of execution of the statement are not performed. Unless otherwise specified, a statement completes normally if all expressions it evaluates and all substatements it executes complete normally.",
  "metadata": {
    "java_version": "11",
    "section_number": "14.11",
    "section_title": "Unknown",
    "chapter_title": "Unknown"
  },
  "url": "https://docs.oracle.com/javase/specs/jls/se11/html/jls-14.html#jls-14.11",
  "section_name": "switch_statement",
  "downloaded_at": "2025-05-27T13:19:41.779261"
}